IDEA Open Model
CalculationSetup Class
Compatible with IDEA StatiCa Beta 20.0
 Concrete calculation setup
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Concrete.CalculationSetup
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class CalculationSetup : OpenObject
Public Class CalculationSetup
	Inherits OpenObject
The CalculationSetup type exposes the following members.
Constructors
Name | Description
CalculationSetup
 Constructor
Top
Properties
Name | Description
CrossSectionCharacteristics
 Cross section charactertistics
Detailing
 Detailing
Fatigue
 ULS fatigue
MNKappaDiagram
 M-N-κ diagram
SlsCrack
 SLS crack
SlsDeflections
 SLS deflections
SlsStiffnesses
 SLS stiffnesses
SlsStressLimitation
 SLS stress limitation
UlsDiagram
 ULS capacity N-M-M
UlsInteraction
 Uls interaction
UlsResponse
 ULS response
UlsShear
 ULS shear
UlsTorsion
 ULS torsion
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace